[NoCoverage] BlockStatement
generate_mutants.js:4:37
 const fs = require('fs');
 
 // Função para ler o arquivo JSON
-function readMutationJson(filePath) {
-  const data = fs.readFileSync(filePath, 'utf-8');
-  return JSON.parse(data);
-}
+function readMutationJson(filePath) {}
 
 // Função para aplicar mutantes

[NoCoverage] StringLiteral
generate_mutants.js:5:42
 
 // Função para ler o arquivo JSON
 function readMutationJson(filePath) {
-  const data = fs.readFileSync(filePath, 'utf-8');
+  const data = fs.readFileSync(filePath, "");
   return JSON.parse(data);
 }

[NoCoverage] ArrayDeclaration
generate_mutants.js:11:22
 
 // Função para aplicar mutantes
 function applyMutants(code, mutants) {
-  let mutatedCodes = [];
+  let mutatedCodes = ["Stryker was here"];
 
   mutants.forEach(mutant => {

[NoCoverage] BlockStatement
generate_mutants.js:13:29
 function applyMutants(code, mutants) {
   let mutatedCodes = [];
 
-  mutants.forEach(mutant => {
-    // Copia o código original para modificar
-    let modifiedCode = code;
-
-    if (mutant.status === "Killed") {
-      const startLine = mutant.location.start.line - 1; // Linhas em 0-index
-      const endLine = mutant.location.end.line; // Linhas em 0-index
-      const lines = modifiedCode.split('\n');
-
-      // Aplica a substituição
-      lines.splice(startLine, endLine - startLine, mutant.replacement);
-      modifiedCode = lines.join('\n');
-      
-      // Armazena o código modificado e informações do mutante
-      mutatedCodes.push({
-        id: mutant.id,
-        code: modifiedCode,
-        replacement: mutant.replacement,
-        mutatorName: mutant.mutatorName,
-        status: mutant.status
-      });
-    }
-  });
+  mutants.forEach(mutant => {});
 
   return mutatedCodes;

[NoCoverage] ConditionalExpression
generate_mutants.js:17:9
     // Copia o código original para modificar
     let modifiedCode = code;
 
-    if (mutant.status === "Killed") {
+    if (true) {
       const startLine = mutant.location.start.line - 1; // Linhas em 0-index
       const endLine = mutant.location.end.line; // Linhas em 0-index

[NoCoverage] BlockStatement
generate_mutants.js:17:37
     // Copia o código original para modificar
     let modifiedCode = code;
 
-    if (mutant.status === "Killed") {
-      const startLine = mutant.location.start.line - 1; // Linhas em 0-index
-      const endLine = mutant.location.end.line; // Linhas em 0-index
-      const lines = modifiedCode.split('\n');
-
-      // Aplica a substituição
-      lines.splice(startLine, endLine - startLine, mutant.replacement);
-      modifiedCode = lines.join('\n');
-      
-      // Armazena o código modificado e informações do mutante
-      mutatedCodes.push({
-        id: mutant.id,
-        code: modifiedCode,
-        replacement: mutant.replacement,
-        mutatorName: mutant.mutatorName,
-        status: mutant.status
-      });
-    }
+    if (mutant.status === "Killed") {}
   });
 

[NoCoverage] ArithmeticOperator
generate_mutants.js:18:25
     let modifiedCode = code;
 
     if (mutant.status === "Killed") {
-      const startLine = mutant.location.start.line - 1; // Linhas em 0-index
+      const startLine = mutant.location.start.line + 1; // Linhas em 0-index
       const endLine = mutant.location.end.line; // Linhas em 0-index
       const lines = modifiedCode.split('\n');

[NoCoverage] StringLiteral
generate_mutants.js:20:40
     if (mutant.status === "Killed") {
       const startLine = mutant.location.start.line - 1; // Linhas em 0-index
       const endLine = mutant.location.end.line; // Linhas em 0-index
-      const lines = modifiedCode.split('\n');
+      const lines = modifiedCode.split("");
 
       // Aplica a substituição

[NoCoverage] ArithmeticOperator
generate_mutants.js:23:31
       const lines = modifiedCode.split('\n');
 
       // Aplica a substituição
-      lines.splice(startLine, endLine - startLine, mutant.replacement);
+      lines.splice(startLine, endLine + startLine, mutant.replacement);
       modifiedCode = lines.join('\n');
       

[NoCoverage] StringLiteral
generate_mutants.js:24:33
 
       // Aplica a substituição
       lines.splice(startLine, endLine - startLine, mutant.replacement);
-      modifiedCode = lines.join('\n');
+      modifiedCode = lines.join("");
       
       // Armazena o código modificado e informações do mutante

[NoCoverage] ObjectLiteral
generate_mutants.js:27:25
       modifiedCode = lines.join('\n');
       
       // Armazena o código modificado e informações do mutante
-      mutatedCodes.push({
-        id: mutant.id,
-        code: modifiedCode,
-        replacement: mutant.replacement,
-        mutatorName: mutant.mutatorName,
-        status: mutant.status
-      });
+      mutatedCodes.push({});
     }
   });

[NoCoverage] BlockStatement
generate_mutants.js:41:54
 }
 
 // Função para escrever resultados em um arquivo
-function writeResultsToFile(results, outputFilePath) {
-  let output = '';
-
-  results.forEach(result => {
-    output += `Modified code:\n${result.code}\n\n`;
-  });
-
-  fs.writeFileSync(outputFilePath, output, 'utf-8');
-  console.log(`Resultados escritos em ${outputFilePath}`);
-}
+function writeResultsToFile(results, outputFilePath) {}
 
 // Função principal

[NoCoverage] BlockStatement
generate_mutants.js:44:29
 function writeResultsToFile(results, outputFilePath) {
   let output = '';
 
-  results.forEach(result => {
-    output += `Modified code:\n${result.code}\n\n`;
-  });
+  results.forEach(result => {});
 
   fs.writeFileSync(outputFilePath, output, 'utf-8');

[NoCoverage] StringLiteral
generate_mutants.js:49:15
   });
 
   fs.writeFileSync(outputFilePath, output, 'utf-8');
-  console.log(`Resultados escritos em ${outputFilePath}`);
+  console.log(``);
 }
 

[NoCoverage] BlockStatement
generate_mutants.js:53:17
 }
 
 // Função principal
-function main() {
-  const mutationFilePath = 'reports/mutation/mutation.json'; // Caminho para o seu arquivo mutation.json
-  const outputFilePath = 'mutated_results.txt'; // Caminho para o arquivo de saída
-  const mutationData = readMutationJson(mutationFilePath);
-  const originalCode = mutationData.files['sum.js'].source;
-  const mutants = mutationData.files['sum.js'].mutants;
-
-  // Aplica os mutantes e obtém os códigos modificados
-  const mutatedResults = applyMutants(originalCode, mutants);
-
-  // Escreve os resultados em um arquivo
-  writeResultsToFile(mutatedResults, outputFilePath);
-}
+function main() {}
 
 // Executa a função principal

[NoCoverage] StringLiteral
generate_mutants.js:54:28
 
 // Função principal
 function main() {
-  const mutationFilePath = 'reports/mutation/mutation.json'; // Caminho para o seu arquivo mutation.json
+  const mutationFilePath = ""; // Caminho para o seu arquivo mutation.json
   const outputFilePath = 'mutated_results.txt'; // Caminho para o arquivo de saída
   const mutationData = readMutationJson(mutationFilePath);

[NoCoverage] StringLiteral
generate_mutants.js:57:43
   const mutationFilePath = 'reports/mutation/mutation.json'; // Caminho para o seu arquivo mutation.json
   const outputFilePath = 'mutated_results.txt'; // Caminho para o arquivo de saída
   const mutationData = readMutationJson(mutationFilePath);
-  const originalCode = mutationData.files['sum.js'].source;
+  const originalCode = mutationData.files[""].source;
   const mutants = mutationData.files['sum.js'].mutants;
 
