[Killed] BlockStatement
sum.js:1:20
-function sum(a, b) {
-    return a + b
-}
+function sum(a, b) {}
 
 module.exports = sum
killedBy: properly adds two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
sum.js:2:12
 function sum(a, b) {
-    return a + b
+    return a - b
 }
 
killedBy: properly adds two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -1
